<a href="#"><img  height="50" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/header.svg" /></a> 



<div align="right"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></a>&nbsp;1&nbsp;Critical&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>&nbsp;1&nbsp;High&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a>&nbsp;2&nbsp;Medium&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></a>&nbsp;1&nbsp;Low</div><br>

<table>

<thead>

<tr>

<th align="left" scope="col">Risk ID</th>

<th align="left" scope="col">Severity</th>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">Folder/s</th>

<th align="left" scope="col">Summary</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

<td>O02-I-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>src</td>

<td>Outbound "To Any allow all TCP" rules to Public IPs</td>

</tr>
<tr>

<td>O04-I-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>src</td>

<td>TCP on all ports can exit your network to Public IPs</td>

</tr>
<tr>

<td>O08-I-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>src</td>

<td>Risky TCP Microsoft services can exit your network to Public IPs</td>

</tr>
<tr>

<td>O10-I-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>src</td>

<td>SMTP can exit your network to more than 256 Public IPs</td>

</tr>
<tr>

<td>O06-NI-GCP</td>

<td align="center"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></a></td>

<td align="center"><sub><a href="#"><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></a></sub></td>

<td>src</td>

<td>SMTP can exit your network to more than 256 Private IPs</td>

</tr>
                 
</tbody>
</table>

**Detailed Risks Report**
---
<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>src</b></h3><div  align="right"><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></a>&nbsp;1&nbsp;Critical&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>&nbsp;1&nbsp;High&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a>&nbsp;2&nbsp;Medium&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></a>&nbsp;1&nbsp;Low</div></summary>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></a>  O02-I-GCP</summary> 

### **Title:**
Outbound "To Any allow all TCP" rules to Public IPs

### **Description:**
Outbound rules of the form "to Any with all TCP" are usually more open than is necessary. Allowing all TCP allows many services that are known to be risky, most of which you probably do not use in your business. Allowing access to all destinations may allow exfiltration of information. 

### **Recommendation:**
Restrict the rules to refer to the destination IPs you really use, and to the the services your applications rely on by deploying a stateful firewall for outbound traffic.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>undefined</td>

  <td>undefined</td>

  <td>tcp</td>

  <td></td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></a>  O04-I-GCP</summary> 

### **Title:**
TCP on all ports can exit your network to Public IPs

### **Description:**
Allowing TCP on all ports to exit your network is extremely risky since this includes many vulnerable services. The largest threat is that of Trojan horses contacting their controllers, followed by unintended information leakage, and spreading of malicious code like viruses and worms.

### **Recommendation:**
Review all the rules that allow outbound traffic with 
TCP on all ports, and limit them to those services you 
actually require by deploying a stateful firewall for outbound traffic.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>undefined</td>

  <td>undefined</td>

  <td>tcp</td>

  <td></td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a>  O08-I-GCP</summary> 

### **Title:**
Risky TCP Microsoft services can exit your network to Public IPs

### **Description:**
Allowing Microsoft's NetBIOS services (TCP/135, TCP/139, TCP/445, TCP/593) to exit your network is risky. These services provide file and printer sharing for Microsoft Windows machines, and are among the most attacked services on the Internet. These Microsoft 
services are a vector for worms and viruses, and they potentially expose your network and data.     

### **Recommendation:**
Eliminate rules which allow access to this port to public IPs.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>undefined</td>

  <td>undefined</td>

  <td>tcp</td>

  <td></td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></a>  O10-I-GCP</summary> 

### **Title:**
SMTP can exit your network to more than 256 Public IPs

### **Description:**
Allowing outbound SMTP access on TCP port 25/465/587 from many internal machines is risky.  Outbound SMTP (E-mail) should only originate from your public mail servers.  E-mail is a vector for many viruses and worms.  Computers that can send E-mail directly (not through your organization's designated mail servers) can bypass your network's E-mail filters, and spread viruses and worms to other networks.  Therefore, outbound SMTP access should be limited to your properly hardened public mail servers. 

### **Recommendation:**
Restrict the rules to refer to only the destination IPs you really use, and limit the number of public IP addresses that can be reached on this port. 

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>undefined</td>

  <td>undefined</td>

  <td>tcp</td>

  <td></td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><a href="#"><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></a>  O06-NI-GCP</summary> 

### **Title:**
SMTP can exit your network to more than 256 Private IPs

### **Description:**
 Allowing outbound SMTP access on TCP port  25/465/587 from many internal machines is risky.  Outbound SMTP (E-mail) should only originate from your public mail servers.  E-mail is a vector for many viruses and worms.  Computers that can send E-mail directly (not through your organization's designated mail servers) can bypass your network's E-mail filters, and spread viruses and worms to other networks.  Therefore, outbound SMTP access should be limited to your properly hardened public mail servers. 
    


### **Recommendation:**
Restrict the rules to refer to only the destination IPs you really use, and limit the number of public IP addresses that can be reached on this port. 

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>undefined</td>

  <td>undefined</td>

  <td>tcp</td>

  <td></td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.o06-ni-gcp will be created
  + resource "google_compute_firewall" "o06-ni-gcp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = [
          + "0.0.0.0/0",
        ]
      + direction          = "EGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "devsecops-fw-multi-ports-egress"
      + network            = "devsecops-network-gcp"
      + priority           = 2200
      + project            = (known after apply)
      + self_link          = (known after apply)

      + allow {
          + ports    = [
              + "25-400",
              + "465",
              + "587",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks         = true
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 1460
      + name                            = "devsecops-network-gcp"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/src\tmp\src.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/src\\tmp\\src.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---


<br>
Pusher: @Artsemil<br>
Action: pull_request<br>
Workflow: Test Repo CI/CD